In [5]:
my_dictionary = {
    "name":"person 1",
    "Age":35,
    "salary":400
}

In [7]:
print(my_dictionary)

{'name': 'person 1', 'Age': 35, 'salary': 400}

In [17]:
my_dictionary={
    'name':['person 1','person 2','person 3','person 4','person 5'],
    'age':[35,100,34,456,67],
    'salary':[400,500,500,560,750000]}

In [92]:
my_dictionary ['Location']:["Mombasa","Kisumu","Nakuru","Eldoret","Homabay"]

In [90]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [400, 500, 500, 560, 750000],
 'Location': ['Mombasa', 'Kisumu', 'Nakuru', 'Eldoret', 'Homabay']}

In [80]:
del my_dictionary['Location']

In [36]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [400, 500, 500, 560, 750000]}

In [38]:
for key,value in my_dictionary.items():
    print(key, value)

name ['person 1', 'person 2', 'person 3', 'person 4', 'person 5']
age [35, 100, 34, 456, 67]
salary [400, 500, 500, 560, 750000]

In [94]:
import pandas as pd

In [96]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [400, 500, 500, 560, 750000],
 'Location': ['Mombasa', 'Kisumu', 'Nakuru', 'Eldoret', 'Homabay']}

In [100]:
df = pd.DataFrame(my_dictionary)

In [102]:
df

       name  age  salary Location
0  person 1   35     400  Mombasa
1  person 2  100     500   Kisumu
2  person 3   34     500   Nakuru
3  person 4  456     560  Eldoret
4  person 5   67  750000  Homabay

In [104]:
import pandas

In [106]:
df

       name  age  salary Location
0  person 1   35     400  Mombasa
1  person 2  100     500   Kisumu
2  person 3   34     500   Nakuru
3  person 4  456     560  Eldoret
4  person 5   67  750000  Homabay

In [108]:
df["name"]

0    person 1
1    person 2
2    person 3
3    person 4
4    person 5
Name: name, dtype: object

In [110]:
df["Location"]

0    Mombasa
1     Kisumu
2     Nakuru
3    Eldoret
4    Homabay
Name: Location, dtype: object

In [112]:
df['salary']

0       400
1       500
2       500
3       560
4    750000
Name: salary, dtype: int64

In [114]:
df[["name","age"]]

       name  age
0  person 1   35
1  person 2  100
2  person 3   34
3  person 4  456
4  person 5   67

In [118]:
df["salary"]+1

0       401
1       501
2       501
3       561
4    750001
Name: salary, dtype: int64

In [128]:
df["age"]+1

0     36
1    101
2     35
3    457
4     68
Name: age, dtype: int64

In [126]:
df.dtypes

name        object
age          int64
salary       int64
Location    object
dtype: object

In [136]:
df["age"]+1

0     37
1    102
2     36
3    458
4     69
Name: age, dtype: int64

In [132]:
df["age"] = df["age"]+1

In [140]:
df

       name  age  salary Location
0  person 1   36     400  Mombasa
1  person 2  101     500   Kisumu
2  person 3   35     500   Nakuru
3  person 4  457     560  Eldoret
4  person 5   68  750000  Homabay

In [157]:
df["age"],df["salary"] = df["age"]+1,df["salary"]+500

In [159]:
df

       name  age  salary Location
0  person 1   37     900  Mombasa
1  person 2  102    1000   Kisumu
2  person 3   36    1000   Nakuru
3  person 4  458    1060  Eldoret
4  person 5   69  750500  Homabay